Autodesk.Revit.UI.AddInCommandBinding.CanExecute
Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether
the command can be executed on the command target.
Remarks:
This callback will be called by Revit's user interface any time there is a contextual change. Therefore, the callback
must be fast and is not permitted to be blocking in any way.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding.Executed
Occurs when the command associated with this AddInCommandBinding executes.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding.BeforeExecuted
Occurs before the command associated with this AddInCommandBinding executes.
Since: 2014

Autodesk.Revit.UI.AddInCommandBinding.RevitCommandId
The Revit command Id.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding.#ctor(Autodesk.Revit.UI.UIApplication,Autodesk.Revit.UI.RevitCommandId)
Constructs a new AddInCommandBinding.
uiApplication: The UI application.
revitCommandId: The Revit command id to identify the command handler you want to replace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when uiApplication or revitCommandId
is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given command already has been bound.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding
This object represents a binding between a Revit command and one or more handlers which
override the behavior of the command in Revit.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding.#ctor(Autodesk.Revit.UI.UIControlledApplication,Autodesk.Revit.UI.RevitCommandId)
Constructs a new AddInCommandBinding.
uiApplication: The UI application.
revitCommandId: The Revit command id to identify the command handler you want to replace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when uiApplication or revitCommandId
is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given command already has been bound.
Since: 2013

Autodesk.Revit.UI.AddInCommandBinding.#ctor(Autodesk.Revit.VSTA.ApplicationEntryPoint,Autodesk.Revit.UI.RevitCommandId)
Constructs a new AddInCommandBinding.
uiApplication: The UI application.
revitCommandId: The Revit command id to identify the command handler you want to replace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when uiApplication or revitCommandId
is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given command already has been bound.
Since: 2013